# IdeaStatiCa.ConnectionApi.Model.ConCrossSectionCustomComponent

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**Outline** | **List&lt;ConCssPoint2D&gt;** |  | [optional]
**Openings** | **List&lt;List&lt;ConCssPoint2D&gt;&gt;** |  | [optional]
**MaterialName** | **string** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)